app/controllers/api/v1/compaigns_controller.rb

    def index
     return render :json => {:compaigns => Compaign.all}
---
SELECT "compaigns".* FROM "compaigns"